# Практическая работа 4

## Задание №1

In [18]:
import numpy as np
from scipy.stats import skew,kurtosis
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
norm_data=np.random.normal(size=1000)
exp_data=np.random.exponential(size=1000)
un_data=np.random.uniform(size=1000)
geom_data=np.random.geometric(0.5,size=1000)

In [3]:
def get_stats(data: np.ndarray):
    data_min=data.min()
    data_max=data.max()
    data_mean=data.mean()
    data_var=data.var()
    data_std=data.std()
    data_quart=np.percentile(data,25)
    data_sevfiv=np.percentile(data,75)
    data_step=data_max-data_min
    data_median=np.median(data)
    data_skew=skew(data)
    data_kurtosis=kurtosis(data)
    return [data_min,data_max,data_mean,data_var,data_std,data_quart,data_sevfiv,data_step,data_median,data_skew,data_kurtosis]
    
    
numpy_df=[get_stats(norm_data),get_stats(exp_data),get_stats(un_data),get_stats(geom_data)]
#print(numpy_df)
numpy_df=np.concatenate(numpy_df).reshape(4,11)

In [4]:
numpy_df

array([[-3.15526237e+00,  2.78914578e+00,  7.71513915e-02,
         1.04732011e+00,  1.02338659e+00, -5.84314374e-01,
         7.80177485e-01,  5.94440816e+00,  8.86731222e-02,
        -1.09720816e-01, -9.30835012e-02],
       [ 4.72001773e-04,  7.30968425e+00,  1.05158821e+00,
         1.16346042e+00,  1.07863823e+00,  2.69810800e-01,
         1.49387809e+00,  7.30921225e+00,  7.01663583e-01,
         1.92596120e+00,  4.94316234e+00],
       [ 2.26633430e-05,  9.99648686e-01,  5.05573730e-01,
         8.57734321e-02,  2.92871016e-01,  2.54646766e-01,
         7.68447107e-01,  9.99626022e-01,  5.09841075e-01,
        -4.02456165e-02, -1.23694527e+00],
       [ 1.00000000e+00,  1.20000000e+01,  2.05800000e+00,
         2.26263600e+00,  1.50420610e+00,  1.00000000e+00,
         3.00000000e+00,  1.10000000e+01,  2.00000000e+00,
         2.12609612e+00,  5.85347224e+00]])

In [5]:
df=pd.DataFrame(numpy_df)
df=df.rename(columns={
    0:'Минимум',1:'Максимум',2:'Среднее',3:'Дисперсия',4:"СКО",5:'25% перцентиль',6:'75% перцентиль',
    7:"Размах",8:"Медиана",9:"Коеф. асимметрии",10:'Коеф. экцесса'
                     },index={0:'Нормальное',1:'Экспонинциальное',2:'Равномерное',3:'Геометрическое'})
df

,Минимум,Максимум,Среднее,Дисперсия,СКО,25% перцентиль,75% перцентиль,Размах,Медиана,Коеф. асимметрии,Коеф. экцесса
Нормальное,-3.155262,2.789146,0.077151,1.047320,1.023387,-0.584314,0.780177,5.944408,0.088673,-0.109721,-0.093084
Экспонинциальное,0.000472,7.309684,1.051588,1.163460,1.078638,0.269811,1.493878,7.309212,0.701664,1.925961,4.943162
Равномерное,0.000023,0.999649,0.505574,0.085773,0.292871,0.254647,0.768447,0.999626,0.509841,-0.040246,-1.236945
Геометрическое,1.000000,12.000000,2.058000,2.262636,1.504206,1.000000,3.000000,11.000000,2.000000,2.126096,5.853472

In [6]:
df.to_csv('task_1.csv',index=True)

## Задание №2

In [7]:
data=pd.read_csv(r'titanic.csv')

In [8]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
data=data.set_index('PassengerId')
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
data.Sex=data.Sex.replace({'male':'0','female':'1'})
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
data=data.sort_values(by=['Sex','Age'],ascending=[True,False])
pd.concat([data.head(10),data.tail(10)])

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",0,80.0,0,0,27042,30.0000,A23,S
852,0,3,"Svensson, Mr. Johan",0,74.0,0,0,347060,7.7750,NaN,S
97,0,1,"Goldschmidt, Mr. George B",0,71.0,0,0,PC 17754,34.6542,A5,C
494,0,1,"Artagaveytia, Mr. Ramon",0,71.0,0,0,PC 17609,49.5042,NaN,C
117,0,3,"Connors, Mr. Patrick",0,70.5,0,0,370369,7.7500,NaN,Q
673,0,2,"Mitchell, Mr. Henry Michael",0,70.0,0,0,C.A. 24580,10.5000,NaN,S
746,0,1,"Crosby, Capt. Edward Gifford",0,70.0,1,1,WE/P 5735,71.0000,B22,S
34,0,2,"Wheadon, Mr. Edward H",0,66.0,0,0,C.A. 24579,10.5000,NaN,S
55,0,1,"Ostby, Mr. Engelhart Cornelius",0,65.0,0,1,113509,61.9792,B30,C
281,0,3,"Duane, Mr. Frank",0,65.0,0,0,336439,7.7500,NaN,Q
613,1,3,"Murphy, Miss. Margaret Jane",1,NaN,1,0,367230,15.5000,NaN,Q
654,1,3,"O'Leary, Miss. Hanora ""Norah""",1,NaN,0,0,330919,7.8292,NaN,Q
670,1,1,"Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)",1,NaN,1,0,19996,52.0000,C126,S
681,0,3,"Peters, Miss. Katie",1,NaN,0,0,330935,8.1375,NaN,Q
698,1,3,"Mullens, Miss. Katherine ""Katie""",1,NaN,0,0,35852,7.7333,NaN,Q
728,1,3,"Mannion, Miss. Margareth",1,NaN,0,0,36866,7.7375,NaN,Q
793,0,3,"Sage, Miss. Stella Anna",1,NaN,8,2,CA. 2343,69.5500,NaN,S
850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",1,NaN,1,0,17453,89.1042,C92,C
864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",1,NaN,8,2,CA. 2343,69.5500,NaN,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [13]:
data=data.dropna()
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",0,80.0,0,0,27042,30.0000,A23,S
97,0,1,"Goldschmidt, Mr. George B",0,71.0,0,0,PC 17754,34.6542,A5,C
746,0,1,"Crosby, Capt. Edward Gifford",0,70.0,1,1,WE/P 5735,71.0000,B22,S
55,0,1,"Ostby, Mr. Engelhart Cornelius",0,65.0,0,1,113509,61.9792,B30,C
457,0,1,"Millet, Mr. Francis Davis",0,65.0,0,0,13509,26.5500,E38,S
...,...,...,...,...,...,...,...,...,...,...,...
436,1,1,"Carter, Miss. Lucile Polk",1,14.0,1,2,113760,120.0000,B96 B98,S
11,1,3,"Sandstrom, Miss. Marguerite Rut",1,4.0,1,1,PP 9549,16.7000,G6,S
619,1,2,"Becker, Miss. Marion Louise",1,4.0,2,1,230136,39.0000,F4,S
206,0,3,"Strom, Miss. Telma Matilda",1,2.0,0,1,347054,10.4625,G6,S
298,0,1,"Allison, Miss. Helen Loraine",1,2.0,1,2,113781,151.5500,C22 C26,S

In [17]:
data.to_excel('prepared_task_2.xlsx')

## Задание №3

In [15]:
data=pd.read_excel('prepared_task_2.xlsx')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",0,80.0,0,0,27042,30.0000,A23,S
1,97,0,1,"Goldschmidt, Mr. George B",0,71.0,0,0,PC 17754,34.6542,A5,C
2,746,0,1,"Crosby, Capt. Edward Gifford",0,70.0,1,1,WE/P 5735,71.0000,B22,S
3,55,0,1,"Ostby, Mr. Engelhart Cornelius",0,65.0,0,1,113509,61.9792,B30,C
4,457,0,1,"Millet, Mr. Francis Davis",0,65.0,0,0,13509,26.5500,E38,S
...,...,...,...,...,...,...,...,...,...,...,...,...
178,436,1,1,"Carter, Miss. Lucile Polk",1,14.0,1,2,113760,120.0000,B96 B98,S
179,11,1,3,"Sandstrom, Miss. Marguerite Rut",1,4.0,1,1,PP 9549,16.7000,G6,S
180,619,1,2,"Becker, Miss. Marion Louise",1,4.0,2,1,230136,39.0000,F4,S
181,206,0,3,"Strom, Miss. Telma Matilda",1,2.0,0,1,347054,10.4625,G6,S
182,298,0,1,"Allison, Miss. Helen Loraine",1,2.0,1,2,113781,151.5500,C22 C26,S

In [19]:
plt.show(data.Survived)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [16]:
data.Survived.sum().item()

123